{"input": "A 23-year-old pregnant woman at 22 weeks gestation presents with burning upon urination. She states it started 1 day ago and has been worsening despite drinking more water and taking cranberry extract. She otherwise feels well and is followed by a doctor for her pregnancy. Her temperature is 97.7°F (36.5°C), blood pressure is 122/77 mmHg, pulse is 80/min, respirations are 19/min, and oxygen saturation is 98% on room air. Physical exam is notable for an absence of costovertebral angle tenderness and a gravid uterus. Which of the following is the best treatment for this patient?,OPTIONS: A: Ampicillin.,B: Ceftriaxone.,C: Ciprofloxacin.,D: Doxycycline.,E:Nitrofurantoin. Answer:", "output": "<think>This is acute uncomplicated cystitis in pregnancy. Fluoroquinolones and doxycycline are contraindicated. Ceftriaxone is for pyelonephritis, not cystitis. Nitrofurantoin is safe and effective in 2nd trimester.</think>
<answer>E</answer>"}
{"input": "A 3-month-old baby died suddenly at night while asleep. His mother noticed that he had died only after she awoke in the morning. No cause of death was determined based on the autopsy. Which of the following precautions could have prevented the death of the baby?,OPTIONS: A: Placing the infant in a supine position on a firm mattress while sleeping.,B: Routine postnatal electrocardiogram (ECG).,C: Keeping the infant covered and maintaining a high room temperature.,D: Application of a device to maintain the sleeping position.,E:Avoiding pacifier use during sleep. Answer:", "output": "<think>This is classic SIDS. The strongest proven preventive measure is placing infants supine on a firm mattress. The other options either increase risk or have no proven benefit.</think>
<answer>A</answer>"}
{"input": "A mother brings her 3-week-old infant to the pediatrician's office because she is concerned about his feeding habits. He was born without complications and has not had any medical problems up until this time. However, for the past 4 days, he has been fussy, is regurgitating all of his feeds, and his vomit is yellow in color. On physical exam, the child's abdomen is minimally distended but no other abnormalities are appreciated. Which of the following embryologic errors could account for this presentation?,OPTIONS: A: Abnormal migration of ventral pancreatic bud.,B: Complete failure of proximal duodenum to recanalize.,C: Error in neural crest cell migration.,D: Abnormal hypertrophy of the pylorus.,E: Failure of lateral body folds to move ventrally and fuse in the midline. Answer:", "output": "<think>A 3-week-old with bilious vomiting suggests duodenal obstruction distal to ampulla. An annular pancreas (abnormal ventral bud migration) causes such symptoms. Other choices do not match presentation.</think>
<answer>A</answer>"}
{"input": "A pulmonary autopsy specimen from a 58-year-old woman who died of acute hypoxic respiratory failure was examined. She had recently undergone surgery for a fractured femur 3 months ago. Initial hospital course was uncomplicated, and she was discharged to a rehab facility in good health. Shortly after discharge home from rehab, she developed sudden shortness of breath and had cardiac arrest. Resuscitation was unsuccessful. On histological examination of lung tissue, fibrous connective tissue around the lumen of the pulmonary artery is observed. Which of the following is the most likely pathogenesis for the present findings?,OPTIONS: A: Thromboembolism.,B: Pulmonary ischemia.,C: Pulmonary hypertension.,D: Pulmonary passive congestion.,E:Pulmonary hemorrhage. Answer:", "output": "<think>Fibrous tissue around pulmonary artery lumen indicates organization of a previous thromboembolism. This aligns with history of immobilization after surgery. The findings are not typical for infarction, hypertension, congestion, or hemorrhage.</think>
<answer>A</answer>"}
{"input": "A 20-year-old woman presents with menorrhagia for the past several years. She says that her menses “have always been heavy”, and she has experienced easy bruising for as long as she can remember. Family history is significant for her mother, who had similar problems with bruising easily. The patient's vital signs include: heart rate 98/min, respiratory rate 14/min, temperature 36.1°C (96.9°F), and blood pressure 110/87 mm Hg. Physical examination is unremarkable. Laboratory tests show the following: platelet count 200,000/mm3, PT 12 seconds, and PTT 43 seconds. Which of the following is the most likely cause of this patient’s symptoms?,OPTIONS: A: Factor V Leiden.,B: Hemophilia A.,C: Lupus anticoagulant.,D: Protein C deficiency.,E: Von Willebrand disease. Answer:", "output": "<think>Normal platelets and PT with prolonged PTT plus mucocutaneous bleeding and family history strongly suggest von Willebrand disease, which impairs vWF and factor VIII.</think>
<answer>E</answer>"}